# TODO: Translation updated at 2021-04-15 10:31

translate english strings:

    # game/core/06_items.rpy:2
    old "СПОРТИВНЫЕ ЛИФ И МИНИ ШОРТЫ"
    new "SPORTS BODICE AND MINI-SHORTS"

    # game/core/06_items.rpy:2
    old "Удобная, открытая и лёгкая одежда для занятий спортом. Так же она прекрасно подойдёт для отдыха на природе."
    new "Comfortable, open and lightweight clothing for sport activities. Perfect for the outdoors."

# TODO: Translation updated at 2021-05-15 00:38

translate english strings:

    # game/core/06_items.rpy:2
    old "ФИЛЬМ \"ЦВЕТ НОЧИ\" 1994 ГОД"
    new ""

    # game/core/06_items.rpy:2
    old "Брюс Уиллис в роли нью-йоркского психолога, потерявшего пациентку - она выбросилась в окно прямо во время сеанса. Чтобы прийти в себя, он едет в Лос-Анджелес к своему другу, с которым они вместе учились.\nТам он присутствует на групповом сеансе психотерапии, а ночью друга зверски убивают с нанесением множества ножевых ранений. Не без участия полиции герой Уиллиса берется вести дальше эту группу, так как следователь подозревает, что убийцей может быть один из больных..."
    new ""

# TODO: Translation updated at 2021-05-15 16:54

translate english strings:

    # game/core/06_items.rpy:2
    old "Брюс Уиллис в роли нью-йоркского психолога, потерявшего пациентку - она выбросилась в окно прямо во время сеанса. Чтобы прийти в себя, он едет в Лос-Анджелес к своему другу, с которым они вместе учились..."
    new ""

