# TODO: Translation updated at 2021-05-02 21:51

translate english strings:

    # game/core/09_opportunities.rpy:4
    old "Да, и похоже о своём мальчике Лиза разговаривает только, когда у неё хорошее настроение..."
    new "Yes, and it seems that Lisa only talks about him when she's in a good mood..."

    # game/core/09_opportunities.rpy:4
    old "Правда, Лиза слегка на меня обиделась, но это я переживу. Подарю ей что-нибудь вкусненькое и она оттает..."
    new "It's true that Lisa was a little offended by me, but I can live with that. I'll give her a sweet treat and she'll thaw..."

    # game/core/09_opportunities.rpy:4
    old "Сомневаюсь, что теперь получится её подставить, уж слишком большое недоверие она ко мне испытывает."
    new "I doubt that I can set her up now, she has too much mistrust for me."

    # game/core/09_opportunities.rpy:4
    old "На этот раз Лиза не стала просить сладости или одежду... Она решила \"наказать меня\" совместным просмотром фильмов перед сном! Всё бы ничего, да смотреть мы будем романтические фильмы... Остаётся надеяться, что это будет терпимо, потому что глазеть на принимающую душ Лизу я люблю."
    new "This time Lisa didn't ask for candy or clothes... She decided to \"punish me\" by watching movies together before bed! That would be all right, but we're going to watch romantic movies... We can only hope that it will be tolerable, because I love to watch Lisa taking a shower."

    # game/core/09_opportunities.rpy:4
    old "Затея Лизы с просмотром романтики оказалась лучше, чем я думал! По крайней мере для меня. Сестрёнка в нижнем белье со мной рядом в одной постели! А на экране ещё и откровенные сцены мелькают, да такие, что у меня встал! Лизу это как-то не обрадовало, но посмотрим, что будет дальше..."
    new "Lisa's idea of watching the romance movie was better than I thought it would be! At least for me. My sister in her underwear next to me in the same bed! The movie was so stimulating that I got a hard-on! Lisa wasn't happy about it, but we'll see what happens next..."

    # game/core/09_opportunities.rpy:4
    old "Лизе надоели мои стояки при просмотре романтических фильмов и она решила, что мы будем теперь смотреть то, от чего у меня точно не встанет - ужастики! Ага, ужастики перед сном, в темноте... Отчаянная у меня сестрёнка!"
    new "Lisa was sick of me getting hard while watching romantic movies, so she decided that we were going to watch something that wouldn't have such an effect. Horro movies! Yeah, horror movies before bed, in the dark... She must be desperate to punish me!"

    # game/core/09_opportunities.rpy:4
    old "Ужастики тоже не спасают от стояка... Лиза от страха так крепко прижимается ко мне своим почти голым телом, что сдержаться и не возбудиться очень трудно... Может, хоть раз попытаться устоять и тогда Лиза не сбежит так быстро?"
    new "Horror movies don't help my hard-on, either... Lisa's fright makes her almost naked body so tightly pressed against me that it's very hard to hold back and not get excited... Maybe I should try to resist for once, and then Lisa wouldn't run away so fast."

    # game/core/09_opportunities.rpy:4
    old "Лиза хоть и убежала в свою постельку, но мне удалось воспользоваться моментом и поцеловать её на ночь, чтобы ей было не так страшно! Может, со временем ей не захочется уходить от меня или даже больше..."
    new "Even though Lisa ran off to her bed, I managed to take advantage of the moment and kiss her good night so she wouldn't be so scared! Maybe in time she wouldn't want to leave..."
    
# TODO: Translation updated at 2021-05-16 13:24

translate english strings:

    # game/core/09_opportunities.rpy:4
    old "Хорошенько подумав, какой совет дать Лизе относительно Алекса, я решил поступить хитро и предложил ей подружиться с Оливией. Таким образом Лиза сможет узнать от неё, действительно ли Алекс так хорош, как ей кажется. Наверняка ведь, он не слишком идеален... А может и ещё хуже... Не знаю, сколько времени понадобиться, чтобы у Лизы получилось ненавязчиво подружиться с Оливией. Пожалуй, мне стоит интересоваться её успехами время от времени..."
    new ""

    # game/core/09_opportunities.rpy:4
    old "Лиза пытается понять, как ей подружиться с Оливией, девушкой Алекса. Для этого Лиза попытается подружиться с кем-то, кому ещё нравится Оливия, чтобы выпытать у него побольше информации об этой девушке..."
    new ""

    # game/core/09_opportunities.rpy:4
    old "Лизе удалось выяснить одну любопытную особенность Оливии: она не носит нижнее бельё! Конечно, это не очень много, но это может оказаться хорошей темой для обсуждения... Глядишь и разболтаются, а там и до дружбы недалеко..."
    new ""

    # game/core/09_opportunities.rpy:4
    old "Наконец-то что-то начало получаться! Лизе удалось выяснить, что Оливия не носит трусы, потому что она из семьи каких-то нудистов или натуристов, не важно. И ещё она обожает бассейны, но у них дома он почему-то не работает. Теперь дело за малым... Чтобы Лиза позвала Оливию к нам в гости, где они будут загорать и купаться. Ну и, конечно, общаться вне школы, что, как я думаю, их сблизит..."
    new ""

    # game/core/09_opportunities.rpy:4
    old "Я познакомился с Оливией! Да, реальность даже немного превзошла все мои ожидания! Оливия абсолютно не стесняется своей наготы... На что я соответствующе отреагировал. Ну ничего, главное, что я произвел впечатление..."
    new ""

    # game/core/09_opportunities.rpy:4
    old "Мне удалось немного поболтать с Оливией. Она оказалась не такой глупой, как я думал. Она весёлая, жизнерадостная, острая на язычок... Ох, попробовать бы его... Но я отвлёкся от дела. Как я понял, их отношения с Алексом не идеальны. Вопрос только в том, кто в этом больше виноват, она или он? Думаю, со временем нам с Лизой удастся узнать больше о них. А пока, я могу, как минимум раз в неделю, совершенно без последствий наблюдать голую грудь Оливии у нас во дворе!"
    new ""

    # game/core/09_opportunities.rpy:4
    old "Мы с Оливией немного пошептались о Лизе. Пускай, это не очень красиво, но мы пришли к выводу, что нужно поработать над сексуальным раскрепощением моей младшей сестрёнки. Хотя бы немного... И компания Оливии идеально для этого подходит! Она девочка без комплексов, очень открытая во всех смыслах. А как говорится, с кем поведёшься, от того и наберёшься!"
    new ""

    # game/core/09_opportunities.rpy:4
    old "Оливия узнала, что по вечерам пятницы наш дом пустеет и мы с Лизой остаёмся одни на какое-то время... Отличное время, чтобы втроём полодырничать у нашего большого экрана в гостиной! И самое классное, что я понятия не имею, во что это выльется! Но в чём я уверен точно, так это в том, что будет интересно..."
    new ""

    # game/core/09_opportunities.rpy:4
    old "Оливия пришла в полночь, как и обещала. Хоть я и догадывался, в каком виде намечаются наши ночные посиделки, но всё равно сомневался, действительно ли мне так повезёт... И Оливия меня не разочаровала! Она сразу же распрощалась с одеждой..."
    new ""

    # game/core/09_opportunities.rpy:4
    old "Только вот все остальные мои надежды разбились о нежелание Лизы находится на одном диване с моим стояком! Невероятно обидно... У меня на диване среди ночи сидят такие классные девчонки и я хочу с ними! Похоже, нужно что-то делать, чтобы для Лизы мой возбуждённый вид стал чем-то довольно обыденным и естественным. Пока она меня стесняется, на диван к ним мне не попасть..."
    new ""

    # game/core/09_opportunities.rpy:4
    old "Ухх... Как же классно оказаться с такими прекрасными девчонками на одном диване! Оливия совершенно голая... Я совершенно голый... Только одна Лиза ещё стесняется... Но думаю, со временем, если такие посиделки станут традицией, она привыкнет и более того, сама начнёт раздеваться! Мечтать не вредно. Главное, не давить на неё, пусть привыкает... Не исключено, что втайне, ей очень нравится всё, что происходит!"
    new ""

    # game/core/09_opportunities.rpy:4
    old "Оливия рассказала мне о кое-каких своих опасениях... После того, как Алекс узнал от неё, какой у нас классный и дорогой дом, он быстренько переобулся и начал проявлять к Лизе большой интерес. Похоже, это Алекс тот ещё альфонс... Теперь главное, ненавязчиво донести этот факт до Лизы! Думаю, она рано или поздно обратиться ко мне за советом... И даже не раз..."
    new ""

    # game/core/09_opportunities.rpy:4
    old "Вот всё и разрешилось с этим Алексом! Оливия его бросила, а Лиза в нём разочаровалась. Хотя, если бы не мои подсказки, Лиза бы точно наделала глупостей и тот первый ночной визит Оливии мог стать последним... Но одну глупость Лиза всё же сделала на радостях - сняла свою маечку прямо на мох глазах! Это очень приятная глупость! Правда, она намекнула, что это может остаться единичным случаем, поэтому лучше делать всё, чтобы моя сестрёнка чувствовала на себе мою заботу..."
    new ""

    # game/core/09_opportunities.rpy:4
    old "Теперь две эти симпатичные попки в моём распоряжении... Аж глаза разбегаются... Хоть Оливия и не особо привязывалась к Алексу, но расставание есть расставание и ей явно нужно время, чтобы оправиться. Как знать, может у нас с ней что-нибудь получится?! Ну а чтобы Лиза чаще сверкала своими голыми сисечками, нужно проявить побольше заботы... Главное постоянно и в разумных пределах! А позаботиться можно и о защите её от маминых наказаний, и о помощи с домашним заданием. А так же уделять внимание и её рукам, помогая с мытьём посуды и делая массаж."
    new ""

