# TODO: Translation updated at 2021-03-02 01:41

translate deutsch strings:

    # game/core/03variables.rpy:22
    old "МОЯ\nКОМНАТА"
    new ""

    # game/core/03variables.rpy:22
    old "МОЯ КОМНАТА"
    new ""

    # game/core/03variables.rpy:22
    old "КОМНАТА\nАЛИСЫ"
    new ""

    # game/core/03variables.rpy:22
    old "КОМНАТА АЛИСЫ"
    new ""

    # game/core/03variables.rpy:22
    old "КОМНАТА\nАННЫ"
    new ""

    # game/core/03variables.rpy:22
    old "КОМНАТА АННЫ"
    new ""

    # game/core/03variables.rpy:22
    old "ВАННАЯ\nКОМНАТА"
    new ""

    # game/core/03variables.rpy:22
    old "ВАННАЯ КОМНАТА"
    new ""

    # game/core/03variables.rpy:22
    old "ГОСТИНАЯ"
    new ""

    # game/core/03variables.rpy:22
    old "ВЕРАНДА"
    new ""

    # game/core/03variables.rpy:22
    old "ДВОР"
    new ""

    # game/core/03variables.rpy:42
    old "Лиза"
    new ""

    # game/core/03variables.rpy:42
    old "Лизы"
    new ""

    # game/core/03variables.rpy:42
    old "Лизе"
    new ""

    # game/core/03variables.rpy:42
    old "Лизу"
    new ""

    # game/core/03variables.rpy:42
    old "Лизой"
    new ""

    # game/core/03variables.rpy:42
    old "Лиза, младшая сестрёнка. Милая и весёлая. Она ещё учится в школе. С Лизой мы общаемся на одной волне, хотя изредка ссоримся. Но если что-то случается, защиты ищет именно у меня."
    new ""

    # game/core/03variables.rpy:42
    old "Алиса"
    new ""

    # game/core/03variables.rpy:42
    old "Алисы"
    new ""

    # game/core/03variables.rpy:42
    old "Алисе"
    new ""

    # game/core/03variables.rpy:42
    old "Алису"
    new ""

    # game/core/03variables.rpy:42
    old "Алисой"
    new ""

    # game/core/03variables.rpy:42
    old "Алиса, моя старшая сестра.  В любой непонятной ситуации бьёт по лицу (в лучшем случае). Недавно закончила школу и, так же, как и я, ищет свой путь. Целыми днями сидит в ноутбуке и занимается каким-то своим блогом. Как это часто бывает с братьями и старшими сёстрами, мы не очень ладим..."
    new ""

    # game/core/03variables.rpy:42
    old "Анна"
    new ""

    # game/core/03variables.rpy:42
    old "Анны"
    new ""

    # game/core/03variables.rpy:42
    old "Анне"
    new ""

    # game/core/03variables.rpy:42
    old "Анну"
    new ""

    # game/core/03variables.rpy:42
    old "Анной"
    new ""

    # game/core/03variables.rpy:42
    old "Анна, моя мама. Сама воспитывает нас с двумя сёстрами уже несколько лет. Работает в офисе какой-то компании. Хотя, зарплата у неё вполне приличная, но почти всё уходит на оплату жилья, еду и одежду."
    new ""

    # game/core/03variables.rpy:53
    old "Макс"
    new ""

    # game/core/03variables.rpy:53
    old "Макса"
    new ""

    # game/core/03variables.rpy:53
    old "Максу"
    new ""

    # game/core/03variables.rpy:53
    old "Максом"
    new ""

    # game/core/03variables.rpy:53
    old "Максе"
    new ""

    # game/core/03variables.rpy:53
    old "Всегда в поисках приключений на свою пятую точку."
    new ""

    # game/core/03variables.rpy:60
    old "спит в нашей комнате (ночь)"
    new ""

    # game/core/03variables.rpy:60
    old "спит в нашей комнате (утро)"
    new ""

    # game/core/03variables.rpy:60
    old "принимает душ"
    new ""

    # game/core/03variables.rpy:60
    old "читает в нашей комнате"
    new ""

    # game/core/03variables.rpy:60
    old "семейный завтрак"
    new ""

    # game/core/03variables.rpy:60
    old "одевается в школу"
    new ""

    # game/core/03variables.rpy:60
    old "одевается в магазин"
    new ""

    # game/core/03variables.rpy:60
    old "одевается к репетитору"
    new ""

    # game/core/03variables.rpy:60
    old "в школе"
    new ""

    # game/core/03variables.rpy:60
    old "в магазине"
    new ""

    # game/core/03variables.rpy:60
    old "у репетитора"
    new ""

    # game/core/03variables.rpy:60
    old "в бассейне"
    new ""

    # game/core/03variables.rpy:60
    old "загорает"
    new ""

    # game/core/03variables.rpy:60
    old "семейный ужин"
    new ""

    # game/core/03variables.rpy:60
    old "моет посуду"
    new ""

    # game/core/03variables.rpy:60
    old "лежит с телефоном в нашей комнате"
    new ""

    # game/core/03variables.rpy:60
    old "принимает ванну"
    new ""

    # game/core/03variables.rpy:60
    old "учит уроки"
    new ""

    # game/core/03variables.rpy:86
    old "спит"
    new ""

    # game/core/03variables.rpy:86
    old "занимается йогой"
    new ""

    # game/core/03variables.rpy:86
    old "готовит завтрак"
    new ""

    # game/core/03variables.rpy:86
    old "одевается на работу"
    new ""

    # game/core/03variables.rpy:86
    old "в своей комнате"
    new ""

    # game/core/03variables.rpy:86
    old "на работе"
    new ""

    # game/core/03variables.rpy:86
    old "читает на веранде"
    new ""

    # game/core/03variables.rpy:86
    old "загорает с Алисой"
    new ""

    # game/core/03variables.rpy:86
    old "в бассейне с Алисой"
    new ""

    # game/core/03variables.rpy:86
    old "готовит ужин"
    new ""

    # game/core/03variables.rpy:86
    old "смотрит ТВ"
    new ""

    # game/core/03variables.rpy:110
    old "спит (ночь)"
    new ""

    # game/core/03variables.rpy:110
    old "спит (утро)"
    new ""

    # game/core/03variables.rpy:110
    old "одевается к подруге"
    new ""

    # game/core/03variables.rpy:110
    old "загорает с Анной"
    new ""

    # game/core/03variables.rpy:110
    old "в бассейне с Анной"
    new ""

    # game/core/03variables.rpy:147
    old "Повседневная"
    new ""

    # game/core/03variables.rpy:150
    old "Для сна"
    new ""

    # game/core/03variables.rpy:154
    old "КУПАЛЬНИК"
    new ""

    # game/core/03variables.rpy:163
    old "За уроками"
    new ""

    # game/core/03variables.rpy:183
    old "Для приготовления завтрака"
    new ""

    # game/core/03variables.rpy:188
    old "Для приготовления ужина"
    new ""

    # game/core/03variables.rpy:191
    old "Для утреннего отдыха"
    new ""

    # game/core/03variables.rpy:195
    old "Для вечернего отдыха"
    new ""

    # game/core/03variables.rpy:214
    old "ПОСМОТРЕТЬ\nФИЛЬМ"
    new ""

    # game/core/03variables.rpy:214
    old "ВЫЙТИ\nИЗ ДОМА"
    new ""

    # game/core/03variables.rpy:214
    old "ПОИГРАТЬ\nС ЛИЗОЙ"
    new ""

    # game/core/03variables.rpy:214
    old "УСТАНОВИТЬ\nКЕЙЛОГГЕР"
    new ""

    # game/core/03variables.rpy:214
    old "УСТАНОВИТЬ\nКАМЕРУ"
    new ""

    # game/core/03variables.rpy:214
    old "СПРЯТАТЬ\nПАУКА"
    new ""

    # game/core/03variables.rpy:214
    old "БРОСИТЬ\nПАУКА"
    new ""

    # game/core/03variables.rpy:214
    old "ИСКАТЬ\nПАУКОВ"
    new ""

    # game/core/03variables.rpy:214
    old "ИСКАТЬ\nСИГАРЕТЫ"
    new ""

    # game/core/03variables.rpy:214
    old "ИСКАТЬ\nКНИГУ"
    new ""

    # game/core/03variables.rpy:214
    old "ЧИСТИТЬ\nБАССЕЙН"
    new ""

    # game/core/03variables.rpy:214
    old "ЧИТАТЬ"
    new ""

    # game/core/03variables.rpy:214
    old "ИСКАТЬ\nКАМЕРУ"
    new ""

    # game/core/03variables.rpy:214
    old "РАЗОБРАТЬ\nКОРОБКИ"
    new ""

    # game/core/03variables.rpy:214
    old "ВКЛЮЧИТЬ\nНОУТБУК"
    new ""

    # game/core/03variables.rpy:214
    old "СПАТЬ"
    new ""

    # game/core/03variables.rpy:214
    old "УСТАНОВИТЬ\nБУДИЛЬНИК"
    new ""

    # game/core/03variables.rpy:214
    old "ВЗДРЕМНУТЬ"
    new ""

    # game/core/03variables.rpy:214
    old "ПРИНЯТЬ\nДУШ"
    new ""

    # game/core/03variables.rpy:214
    old "ПРИНЯТЬ\nВАННУ"
    new ""

    # game/core/03variables.rpy:214
    old "ПОГОВОРИТЬ"
    new ""

    # game/core/03variables.rpy:214
    old "МЫТЬ\nПОСУДУ"
    new ""

    # game/core/03variables.rpy:272
    old "ПАУК"
    new ""

    # game/core/03variables.rpy:272
    old "Самое страшное существо на свете. С точки зрения Алисы, конечно. Нужно этим воспользоваться в подходящий момент!"
    new ""

    # game/core/03variables.rpy:272
    old "СКРЫТАЯ КАМЕРА"
    new ""

    # game/core/03variables.rpy:272
    old "Высокотехнологичная микро-камера, предназначенная для скрытного наблюдения. Имеет радиомодуль для беспроводной передачи зашифрованного цифрового видеосигнала."
    new ""

    # game/core/03variables.rpy:272
    old "ФИЛЬМ \"ШКОЛЬНИЦЫ\""
    new ""

    # game/core/03variables.rpy:272
    old "Строгая учительница пытается наказать непослушных школьниц..."
    new ""

    # game/core/03variables.rpy:272
    old "ШЕЛКОВЫЙ ХАЛАТ"
    new ""

    # game/core/03variables.rpy:272
    old "Короткий, лёгкий, почти шёлковый халат высшего качества. Made in China."
    new ""

    # game/core/03variables.rpy:272
    old "КУПАЛЬНИК КРАСНЫЙ"
    new ""

    # game/core/03variables.rpy:272
    old "Купальник для тех, кто не стесняется своего тела. Скрывает только самые интимные участки. Всё остальное открыто для солнца и глаз окружающих."
    new ""

    # game/core/03variables.rpy:272
    old "СИГАРЕТЫ"
    new ""

    # game/core/03variables.rpy:272
    old "Пачка сигарет Lucky Strike. Для настоящих мужчин!"
    new ""

    # game/core/03variables.rpy:272
    old "МАЛЕНЬКОЕ ЧЕРНОЕ ПЛАТЬЕ"
    new ""

    # game/core/03variables.rpy:272
    old "Отличный подарок для девушки, желающей произвести фурор на вечеринке или дискотеке."
    new ""

    # game/core/03variables.rpy:272
    old "ЛЮБЯЩАЯ РУБИ"
    new ""

    # game/core/03variables.rpy:272
    old "Роман о запретной любви между секретаршей и её начальником, полный любви, страсти, эмоций и... мистики."
    new ""

    # game/core/03variables.rpy:272
    old "ПРЕМЬЕР-МИНИСТР"
    new ""

    # game/core/03variables.rpy:272
    old "Новый эротический роман, входящий в Топ-10 лучших романов и новелл США!"
    new ""

    # game/core/03variables.rpy:272
    old "БЫТЬ КУКЛОЙ"
    new ""

    # game/core/03variables.rpy:272
    old "В поместье Картера красивые девушки обучаются, чтобы стать идеальными жёнами для самых влиятельных людей этого мира."
    new ""

    # game/core/03variables.rpy:272
    old "КНИГА ОРГАЗМОВ"
    new ""

    # game/core/03variables.rpy:272
    old "Что получится, если собрать самые горячие истории об оргазмах от 69 различных авторов?"
    new ""

    # game/core/03variables.rpy:272
    old "ИСТОРИЯ О"
    new ""

    # game/core/03variables.rpy:272
    old "Это история о доминировании и подчинении. История об одной прекрасной девушке по имени О."
    new ""

    # game/core/03variables.rpy:272
    old "СТРЕМЯНКА"
    new ""

    # game/core/03variables.rpy:272
    old "Небольшая стремянка, позволяющая достать то, для чего не хватает роста"
    new ""

    # game/core/03variables.rpy:272
    old "WEB STANDARDS"
    new ""

    # game/core/03variables.rpy:272
    old "Книга рассказывает о способах создавать свои сайты, работающие на любых устройствах."
    new ""

    # game/core/03variables.rpy:272
    old "ЛЁГКАЯ ПИЖАМА"
    new ""

    # game/core/03variables.rpy:272
    old "Удобнейшие маечка и шортики. В них не жарко душными летними ночами, и так же уютно в течение всего года."
    new ""

    # game/core/03variables.rpy:272
    old "НОЧНУШКА"
    new ""

    # game/core/03variables.rpy:272
    old "Полупрозрачные сорочка и трусики. Облегающий фасон подчёркивает все достоинства и изгибы фигуры, а лёгкое кружево придаст ещё больше сексуальности."
    new ""

    # game/core/03variables.rpy:272
    old "Набор косметики"
    new ""

    # game/core/03variables.rpy:272
    old "Небольшой набор косметики для повседневного использования. Для женщин - только лучшее..."
    new ""

    # game/core/03variables.rpy:272
    old "Шоколад \"Ritter Sport\" mini (9 штук)"
    new ""

    # game/core/03variables.rpy:272
    old "Шоколадное наслаждение для каждого случая... Множество лакомых сортов с лучшими ингредиентами со всего мира."
    new ""

    # game/core/03variables.rpy:272
    old "Шоколад \"Ritter Sport\" (4 штуки)"
    new ""

    # game/core/03variables.rpy:272
    old "Конфеты \"Raffaello\" (16 штук)"
    new ""

    # game/core/03variables.rpy:272
    old "Хрустящие кокосовые конфеты с цельным миндальным орехом. Вместо тысячи слов..."
    new ""

    # game/core/03variables.rpy:272
    old "Конфеты \"Raffaello\" (24 штуки)"
    new ""

    # game/core/03variables.rpy:272
    old "Конфеты \"Ferrero Rocher\" (16 штук)"
    new ""

    # game/core/03variables.rpy:272
    old "Сочетание цельного фундука и восхитительного сливочно-орехового крема в хрустящей вафельной оболочке подарит вам неповторимые вкусовые ощущения."
    new ""

    # game/core/03variables.rpy:272
    old "Конфеты \"Ferrero Rocher\" (24 штуки)"
    new ""

    # game/core/03variables.rpy:272
    old "КРЕМ ДЛЯ ЗАГАРА"
    new ""

    # game/core/03variables.rpy:272
    old "Легкий, хорошо впитывающийся препарат для ускорения загара обладает увлажняющими и защитными свойствами. Рекомендуется для применения на пляже и в солярии."
    new ""

    # game/core/03variables.rpy:272
    old "МУЖСКИЕ МАЙКА И ШОРТЫ"
    new ""

    # game/core/03variables.rpy:272
    old "Свободный и лёгкий летний комплект одежды на каждый день."
    new ""

    # game/core/03variables.rpy:272
    old "КОНФЕТЫ С ЛИКЁРОМ"
    new ""

    # game/core/03variables.rpy:272
    old "Шоколадные конфеты с ликёром. Уникальные ароматизаторы скрывают вкус алкоголя. Отлично поднимают настроение. Очень крепкие."
    new ""

    # game/core/03variables.rpy:272
    old "КОМПЛЕКТ ТЁМНОГО НИЖНЕГО БЕЛЬЯ"
    new ""

    # game/core/03variables.rpy:272
    old "Отличное нижнее бельё тёмного цвета. Отличный подарок для любимой девушки."
    new ""

    # game/core/03variables.rpy:272
    old "СЕКС-ОБРАЗОВАНИЕ"
    new ""

    # game/core/03variables.rpy:272
    old "Книга обо всём, связанным с сексом. Отлично подходит для обучения подрастающего поколения."
    new ""

    # game/core/03variables.rpy:272
    old "ФОТОАППАРАТ"
    new ""

    # game/core/03variables.rpy:272
    old "Профессиональный фотоаппарат с объективом. Не новый, но в отличном состоянии. Подойдёт как для новичков, так и для профессионалов."
    new ""

    # game/core/03variables.rpy:272
    old "КОРОТКАЯ ПИКАНТНАЯ СОРОЧКА"
    new ""

    # game/core/03variables.rpy:272
    old "Соблазнительная чёрная сорочка выполнена из эластичного тюля. В комплект так же входят трусики-стринги."
    new ""

    # game/core/03variables.rpy:272
    old "ЧЁРНОЕ СЕКСУАЛЬНОЕ БОДИ"
    new ""

    # game/core/03variables.rpy:272
    old "Прозрачное сетчатое боди с открытой спиной чёрного цвета."
    new ""

    # game/core/03variables.rpy:272
    old "ЧЁРНОЕ КРУЖЕВНОЕ БОДИ"
    new ""

    # game/core/03variables.rpy:272
    old "Женское сексуальное нижнее бельё с кружевным узором по краям."
    new ""

    # game/core/03variables.rpy:316
    old "Скрытые камеры"
    new ""

    # game/core/03variables.rpy:316
    old "Я нашёл пустую коробку из под скрытой камеры. Видимо, она установлена где-то в доме. Нужно поискать как следует - вдруг, кто-то за нами наблюдал всё это время?"
    new ""

    # game/core/03variables.rpy:316
    old "Итак, я нашёл скрытую камеру в гостиной. Она вмонтирована в стену, видимо, во время ремонта. Поэтому, её нельзя вытащить, не повредив. Кроме того, оказалось, что камера сейчас ни к чему не подключена. Может быть, стоит целенаправленно изучить способы подключения камер, чтобы извлечь из неё какую-то пользу..."
    new ""

    # game/core/03variables.rpy:316
    old "Ко мне пришла отличная идея - заработать на трансляции с веб-камеры в интернет, но я об этом знаю очень мало... Может быть, поможет какая-то литература?"
    new ""

    # game/core/03variables.rpy:316
    old "Итак, я внимательно прочитал книгу Web Standards и разобрался как сделать свой сайт. Пожалуй, стоит начать именно с этого. Мне потребуются деньги на домен, хостинг и оплату готового шаблона с дизайном. Всего нужно порядка $100."
    new ""

    # game/core/03variables.rpy:316
    old "Наконец-то, у меня есть свой собственный сайт, где транслируется изображение с камеры из гостиной! Теперь нужно увеличить аудиторию, ведь чем больше людей, тем больше доход от рекламных баннеров. Сделать это можно с помощью вложений в рекламу своего сайта. Кроме того, если в кадре происходит что-то интересное, аудитория также растёт."
    new ""

    # game/core/03variables.rpy:316
    old "{i}{b}Внимание:{/b} Пока это всё, что можно сделать для данной \"возможности\" в текущей версии игры.{/i}"
    new ""

    # game/core/03variables.rpy:324
    old "Наставник"
    new ""

    # game/core/03variables.rpy:324
    old "Кажется, Лиза совсем ничего не знает о мальчиках. Возможно, она даже порно ни разу не видела, раз так удивилась обычному утреннему стояку. Может быть, стоит заняться просветительской деятельностью среди своей младшей сестрёнки? Но с чего начать? Поговорить?"
    new ""

    # game/core/03variables.rpy:324
    old "Я поговорил с Лизой и стало ясно, что для того, чтобы чему-то учить, нужно сначала завоевать авторитет."
    new ""

    # game/core/03variables.rpy:324
    old "Лиза снова увидела мой утренний стояк. На этот раз маму она не позвала, что уже хорошо. Хотя, смотрела она на мой член не только с подозрением, но ещё и с интересом. По крайней мере, мне так показалось. Думаю, нужно с ней об этом поговорить..."
    new ""

    # game/core/03variables.rpy:324
    old "Это, конечно, не точно, но Лиза хотела потрогать мой член, думая, что я спал. И судя по её реакции на то, что я это увидел, даже она сама с себя удивилась. Посмотрим, что она потом об этом скажет..."
    new ""

    # game/core/03variables.rpy:324
    old "Похоже, интерес Лизы к противоположному полу и всему, что связано со взрослой жизнью, растёт не по дням, а по часам. Не знаю уж, мой стоящий по утрам член так её раззадорил или ещё что-то, но она согласилась меня слушаться по вопросам о мальчиках и всем этим взрослым штучкам... Вот только прежде, чем учить, может быть стоит самому чему-то научиться? А самое главное - при этом ничего не испортить, а то она снова откажется..."
    new ""

    # game/core/03variables.rpy:324
    old "Итак, Лиза поинтересовалась, чему же я собираюсь её учить. И сразу же поставила меня в глупую ситуацию. Я вроде бы должен её учить, но сам не умею даже целоваться! Нужно срочно найти кого-то, кто бы мне помог в этом... Да, легко сказать..."
    new ""

    # game/core/03variables.rpy:324
    old "Кажется, я нашёл ту, которая научит меня целоваться. И это... моя тётя! Это так странно... Ну она точно в этом вопросе понимает достаточно. Да я был бы рад любому учителю, но такой - идеален! Да, тётя Кира сказала, что лучше об этом поговорить в более интимной обстановке. Например, когда она ночью смотрит телек."
    new ""

    # game/core/03variables.rpy:324
    old "Тётя Кира превосходный учитель поцелуев! Она согласилась меня иногда учить. Кто знает, может быть она научит и чему-то ещё?\n\nНу всё. Теперь нужно практиковаться в поцелуях с тётей Кирой и передавать полученные знания Лизе... Только вот её ещё нужно убедить..."
    new ""

    # game/core/03variables.rpy:324
    old "Я поговорил с Лизой насчёт её обучения. Она выдвинула ряд условий, среди которых запрет мне к ней прикасаться, если она против. Ну уже что-то."
    new ""

    # game/core/03variables.rpy:324
    old "Похоже обучаться Лиза согласна только если у неё хорошее настроение..."
    new ""

    # game/core/03variables.rpy:324
    old "Мне удалось впечатлить Лизу своим искусством целоваться! Хотя, пока на искусство это не тянет, но ей понравилось! Всё-таки, тётя Кира отличный учитель. Но нужно продолжать практиковаться."
    new ""

    # game/core/03variables.rpy:324
    old "Лиза намекнула, что не против двигаться дальше и я решил увлечь её поцелуями настолько, чтобы ей нравились при этом и мои прикосновения. А для этого нужно больше целоваться с тётей Кирой по ночам..."
    new ""

    # game/core/03variables.rpy:324
    old "Лизе очень нравится как я целуюсь. Она даже намекнула, что пора бы научить её ещё чему-то полезному. На этот раз, как мне кажется, стоит подтянуть теорию. Может быть, купить ей какую-то книжку по анатомии, чтобы она разобралась в физиологии и поняла, какие естественные процессы могут происходить между мужчинами и женщинами?"
    new ""

    # game/core/03variables.rpy:324
    old "Я решил, что и мне самому будет полезно прочитать купленную для Лизы книгу. Вдруг, тем самым, я что-то для себя интересное открою..."
    new ""

    # game/core/03variables.rpy:324
    old "Книга прочитана! Не то, чтобы много всего нового я для себя открыл, но есть то, что может помочь нам с Лизой ещё больше сблизиться. А пока можно ей книжку подарить..."
    new ""

    # game/core/03variables.rpy:324
    old "Я подарил Лизе книжку, которая содержит много ответов на её вопросы. Нужно будет поинтересоваться через какое-то время, что она об этой книге думает..."
    new ""

    # game/core/03variables.rpy:324
    old "Я подарил Лизе книжку, которая содержит много ответов на её вопросы. Да мне и самому было бы полезно её почитать, но лень.\n\n\nНужно будет поинтересоваться через какое-то время, что она об этой книге думает..."
    new ""

    # game/core/03variables.rpy:324
    old "Только я подарил Лизе книгу по сексуальному образованию, как тут же нарисовался Эрик. Он, видите ли, вместе с моей мамой, собирается взяться за её сексуальное воспитание! \n\nВ обмен на возможность подглядывать за этим процессом и кое-каким бонусом, с которым мне нужно будет определиться со временем, я согласился его поддержать. Мы же с ним как-никак \"друзья\"."
    new ""

    # game/core/03variables.rpy:324
    old "Только я подарил Лизе книгу по сексуальному образованию, как тут же нарисовался Эрик. Он, видите ли, вместе с моей мамой, собирается взяться за её сексуальное воспитание! \n\nВ обмен на возможность подглядывать за этим процессом, я согласился его поддержать. Незачем мне враждовать с Эриком."
    new ""

    # game/core/03variables.rpy:324
    old "Только я подарил Лизе книгу по сексуальному образованию, как тут же нарисовался Эрик. Он, видите ли, вместе с моей мамой, собирается взяться за её сексуальное воспитание! \n\nНе смотря на то, что мы с ним \"дружим\", я постарался убедить его, что Лизе ещё рановато это познавать... Это не особо помогло, но Эрик дал мне пару недель на \"чтение книг по теме сексуального образования\" с Лизой. По крайней мере, я выиграл немного времени, которое стоит использовать с умом..."
    new ""

    # game/core/03variables.rpy:324
    old "Только я подарил Лизе книгу по сексуальному образованию, как тут же нарисовался Эрик. Он, видите ли, вместе с моей мамой, собирается взяться за её сексуальное воспитание! \n\nЯ, естественно, отказался ему в этом содействовать. Враждовать, так враждовать! Вряд ли теперь у меня есть много времени, чтобы избавиться от него, так что нужно скорее искать такой способ..."
    new ""

    # game/core/03variables.rpy:324
    old "Как выяснилось, Эрик проплатил репетитора для Лизы по воскресеньям, чтобы улучшить её оценки, а в действительности, чтобы втереться к ней в доверие. Теперь он и моя мама будут по понедельникам проводить для Лизы уроки сексуального воспитания..."
    new ""

    # game/core/03variables.rpy:324
    old "Как выяснилось, Эрик проплатил дополнительные курсы для Лизы в школе, чтобы улучшить её оценки, а в действительности, чтобы втереться к ней в доверие. А заодно и от меня отстранить, ведь теперь моя помощь с уроками ей особо и не нужна. И ещё он и моя мама будут по понедельникам проводить для Лизы уроки сексуального воспитания..."
    new ""

    # game/core/03variables.rpy:350
    old "Особые книги"
    new ""

    # game/core/03variables.rpy:350
    old "Алиса читает какие-то книги, но не хочет говорить о них. На порно журналы не похоже... Что же ещё там может быть? Нужно попытаться выяснить это как можно скорее... Любопытно же!"
    new ""

    # game/core/03variables.rpy:350
    old "Я нашёл какую-то книгу, но из названия ничего не понятно, а читать саму книгу ни времени, ни желания нет. Может быть, поискать о ней информацию в интернете?"
    new ""

    # game/core/03variables.rpy:350
    old "Вот это да! Я был не так далёк от истины. Конечно, это не порно, но уж точно эротика, да ещё какая! Видимо, Алисе нравятся любовные романы с эротическими оттенками, так сказать. Может быть, стоит ей подарить подобную книгу и посмотреть на её реакцию?"
    new ""

    # game/core/03variables.rpy:350
    old "Судя по реакции Алисы, подарок ей понравился. Видимо, стоит периодически заходить в книжный интернет-магазин и смотреть новинки. Возможно, таким образом удастся чуть-чуть улучшить отношения с Алисой."
    new ""

    # game/core/03variables.rpy:357
    old "Одноклассник"
    new ""

    # game/core/03variables.rpy:357
    old "Очевидно, Лиза по уши влюблена в какого-то своего одноклассника по имени Алекс. Как она рассказала, у него есть подруга Оливия, самая красивая девочка в школе. Лиза ждёт от меня помощи в виде совета - как ей быть дальше.\n\nВ голову приходит сразу три варианта: предложить ей забыть об этом парне, предложить ей сражаться с Оливией за Алекса до конца или же помочь переключить внимание Оливии на кого-то другого..."
    new ""

    # game/core/03variables.rpy:357
    old "Да, и похоже о своём мальчике Лиза разговаривает только, когда у неё хорошее настроение... \n\n{i}{b}Внимание:{/b} Пока это всё, что можно сделать для данной \"возможности\" в текущей версии игры.{/i}"
    new ""

    # game/core/03variables.rpy:357
    old "Я предложил Лизе забыть о её парне и, похоже, она прислушалась к моему совету. Конечно, она расстроилась, но может быть это и к лучшему? Возможно, она сосредоточит своё внимание на ком-то, кто всегда рядом?"
    new ""

    # game/core/03variables.rpy:357
    old "Я убедил Лизу, что нужно бороться за своё счастье. Осталось только разработать план и достичь поставленной цели!"
    new ""

    # game/core/03variables.rpy:357
    old "Я разработал хитрый план, который сделает всех счастливыми: Лиза должна подужиться с Оливией, стать её лучшей подругой, познакомить её со мной, а я её соблазню... Ну, попытаюсь. Но если получится, то у меня будет девушка, а у Лизы её Алекс. Отличный план! Вот только как соблазняют самых красивых девочек школы?"
    new ""

    # game/core/03variables.rpy:364
    old "Блог"
    new ""

    # game/core/03variables.rpy:364
    old "Алиса рассказала о своём блоге и о своей проблеме, связанной с потерей вещей во время переезда. Теперь ей нечего показывать, не в чем вести блог и, вообще, она в печали. Кажется, она согласна на любую помощь и идеи, даже от меня! Может быть, посидеть в интернете, поискать какое-то решение?"
    new ""

    # game/core/03variables.rpy:364
    old "В результате поисков информации в интернете о том, чем могла бы заняться Алиса, удалось кое-что выяснить. Самыми популярными оказались блоги, где ведущие - девушки. Причём, чем более откровенные наряды и чем больше грудь, тем более популярны шоу. С грудью, конечно, ничего не поделать, а вот наряды... Может быть, поговорить с ней об этом?"
    new ""

    # game/core/03variables.rpy:364
    old "Я пообщался с Алисой насчёт своих выводов о популярности блога и намекнул, что можно рекламировать не только крема и лаки, но и нижнее бельё, например. Но крутить своей попкой перед камерой она не собирается, так что покрутит сама того не зная, когда я поставлю скрытую камеру в её комнату. Как знать, сколько всего интересного можно будет увидеть..."
    new ""

    # game/core/03variables.rpy:364
    old "Я пообщался с Алисой насчёт своих выводов о популярности блога и намекнул, что можно рекламировать не только крема и лаки, но и нижнее бельё, например. Но крутить своей попкой перед камерой она не собирается... А зря, ведь она и так уже это делает на скрытую камеру, которую я поставил в её комнате. Как знать, может мне удастся увидеть что-то, чего ещё не было..."
    new ""

    # game/core/03variables.rpy:364
    old "Я решил снова предложить Алисе идею по развитию её блога - рекламировать нижнее бельё. Удивительно, но она согласилась! Правда, теперь мне нужно найти нижнее бельё для того, чтобы она заинтересовала свою аудиторию и привлекла внимание рекламодателей..."
    new ""

    # game/core/03variables.rpy:364
    old "Я подарил Алисе симпатичный комплект нижнего белья. Ей очень понравилось. Правда, увидеть мне ничего не удалось, только Алису уже в этом самом белье, но даже это было волнующе... Что самое любопытное, она намекнула, что можно поискать и что-то более... сексуальное!"
    new ""

    # game/core/03variables.rpy:364
    old "Я подарил Алисе симпатичный комплект нижнего белья. Ей очень понравилось. Она даже при мне его примерила! Увидел я не так чтобы много всего, но было волнующе... Что самое любопытное, она намекнула, что можно поискать и что-то более... сексуальное!"
    new ""

    # game/core/03variables.rpy:364
    old "Я подобрал кое-что более сексуальное для Алисы, а именно - полупрозрачное боди. В меру откровенное, потому что иначе я рискую не увидеть его на ней. А при дарении, пока она была под впечатлением, я ещё и умудрился уговорить её попозировать мне... нужны же ей качественные фотоснимки для развития блога! \n\nМного я не наснимал, всё-таки мы с Алисой ещё не настолько близки, но уже лучше находим общий язык. Посмотрим, что будет дальше..."
    new ""

    # game/core/03variables.rpy:364
    old "Я подобрал кое-что более сексуальное для Алисы, а именно - полупрозрачное боди. В меру откровенное, потому что иначе я рискую не увидеть его на ней. А при дарении, пока она была под впечатлением, я ещё и умудрился уговорить её попозировать мне... нужны же ей качественные фотоснимки для развития блога! \n\nФотосессия вышла очень интересной, спасибо за это конфетам с алкоголем. Мне удалось сделать несколько весьма горячих снимков с Алисой и они прекрасно подойдут для моей коллекции... Хоть мы с Алисой всё ещё не очень близки, но уже лучше находим общий язык. Посмотрим, что будет дальше..."
    new ""

    # game/core/03variables.rpy:364
    old "Только мои отношения с Алисой начали понемногу налаживаться, как ко мне подвалил Эрик с расспросами о том, чем там моя старшая сестрёнка занимается за компьютером... \n\nЯ рассказал ему всё, что знал о её блоге. Ну а как иначе, мы же друзья. Теперь он собирается помочь ей с развитием блога и мне лучше этому не мешать... а ещё лучше - помогать ему с этим."
    new ""

    # game/core/03variables.rpy:364
    old "Только мои отношения с Алисой начали понемногу налаживаться, как ко мне подвалил Эрик с расспросами о том, чем там моя старшая сестрёнка занимается за компьютером... \n\nЯ решил не облегчать ему жизнь и сказал, что мало об этом знаю. Эрик же, чтобы не тратить своё время, попросил меня за несколько недель узнать как можно больше о занятиях Алисы..."
    new ""

    # game/core/03variables.rpy:364
    old "Только мои отношения с Алисой начали понемногу налаживаться, как ко мне подвалил Эрик с расспросами о том, чем там моя старшая сестрёнка занимается за компьютером... \n\nЯ решил прекратить вражду с Эриком и рассказал ему всё, что знал о её блоге. Теперь он собирается помочь ей с развитием блога и мне лучше этому не мешать... а ещё лучше - помогать ему с этим."
    new ""

    # game/core/03variables.rpy:364
    old "Только мои отношения с Алисой начали понемногу налаживаться, как ко мне подвалил Эрик с расспросами о том, чем там моя старшая сестрёнка занимается за компьютером... \n\nУ меня совершенно нет желания помогать ему подкатывать к моей сестрёнке, что ему и сказал. У нас ведь вражда! Главное, чтобы мне это боком не вышло..."
    new ""

    # game/core/03variables.rpy:364
    old "Теперь, каждую среду, пока мама принимает ванну, Эрик тусуется у Алисы в комнате, якобы помогая ей с блогом. Понятно, что на самом деле он хочет поглазеть на Алису в нижнем белье... а в будущем и в трусики к ней залезть."
    new ""

    # game/core/03variables.rpy:364
    old "Теперь, каждую среду, пока мама принимает ванну, Эрик тусуется у Алисы в комнате, якобы помогая ей с блогом. Понятно, что на самом деле он хочет поглазеть на Алису в нижнем белье... а в будущем и в трусики к ней залезть.\n\nА ещё мне повезло узнать, что Эрик собирается купить ей новое кружевное боди! Обидно, конечно, что она попросила об этом не меня. Интересно, как Эрик отреагирует, если я его опережу с покупкой..."
    new ""

    # game/core/03variables.rpy:364
    old "Если я хочу это сделать, то нужно торопиться, чтобы успеть подарить ей боди до субботы... И дарить надо, когда Алиса занимается блогом, тогда она может быть переоденется при мне!"
    new ""

    # game/core/03variables.rpy:364
    old "Что бы я там не хотел, теперь уже поздно! Мне остаётся только наблюдать..."
    new ""

    # game/core/03variables.rpy:364
    old "Эрик подарил Алисе кружевное боди, которое она просила. Похоже, это их сблизило, чего он и добивался, а вот я не успел его обойти. Нужно скорее избавляться от Эрика, иначе он заберёт у меня всё..."
    new ""

    # game/core/03variables.rpy:364
    old "Эрик подарил Алисе кружевное боди, которое она просила. Похоже, это их сблизило, чего он и добивался. И будет добиваться дальше..."
    new ""

    # game/core/03variables.rpy:364
    old "Мне удалось опередить Эрика с покупкой кружевного боди и подарить его Алисе первым! Она даже переоделась при мне и не слишком при этом прикрывалась. Правда в конце у неё ногу свело, но это значит, что у меня теперь есть весомый повод забраться в массаже её прелестных ножек несколько дальше, чем раньше... И мне стоит попробовать это сделать!"
    new ""

    # game/core/03variables.rpy:364
    old "Эрик оказался, мягко говоря, не в восторге от того, что я опередил его с дарением кружевного боди для Алисы.\n\nОн предупредил, что если я ещё раз испорчу его планы, друзьями нам дальше не быть... А в качестве наказания, лишил меня всех возможных \"премиальных\", что мне теперь нужно как-то исправить..."
    new ""

    # game/core/03variables.rpy:364
    old "Эрик оказался, мягко говоря, не в восторге от того, что я опередил его с дарением кружевного боди для Алисы.\n\nОн пригрозил, что у меня теперь будут большие проблемы! Как будто меня этим можно испугать..."
    new ""

    # game/core/03variables.rpy:393
    old "Купальник"
    new ""

    # game/core/03variables.rpy:393
    old "Я заметил, что Лиза всё время в одном и том же закрытом купальнике. Так же невозможно толком загореть? Она тоже так считает, но другого нет. Остальные пропали с другими вещами во время переезда. Может быть, удастся как-то ей помочь?"
    new ""

    # game/core/03variables.rpy:393
    old "Во время завтрака Лиза намекнула маме, что нужно бы купить во время шоппинга купальник, который не скрывает половину тела и в котором можно загорать..."
    new ""

    # game/core/03variables.rpy:393
    old "Выяснилось, что во время последнего шоппинга забыли купить Лизе купальник, о котором она просила. Теперь придётся ждать до следующих выходных, когда Эрик снова повезёт всех за покупками. Но в этот раз сам Эрик пообещал ей подарить этот купальник. Может быть, его опередить?"
    new ""

    # game/core/03variables.rpy:393
    old "Мне удалось накопить немного денег и купить тот самый купальник, который так хотела Лиза. Кажется, она меня любит! А Эрик теперь обломается со своими подарками, ведь я уже подарил то, что так хочет младшая сестрёнка!"
    new ""

    # game/core/03variables.rpy:393
    old "Мне не удалось купить и подарить Лизе купальник до того, как это сделал для неё Эрик. Кажется, их отношения улучшились. Вот если бы я подарил тот чёртов купальник, то Лиза была бы мне очень благодарна, а не ему..."
    new ""

    # game/core/03variables.rpy:402
    old "Тусовщица"
    new ""

    # game/core/03variables.rpy:402
    old "Алиса настойчиво просит маму купить ей вечернее платье для посещения ночных клубов. Та ей регулярно отказывала, пока Эрик не предложил подарить ей платье во время следующего шоппинга. Нужно поспешить, если я хочу сделать это первым!"
    new ""

    # game/core/03variables.rpy:402
    old "Мне удалось скопить приличную сумму и купить платье для Алисы. Теперь, нужно успеть его подарить ей, пока это не сделал кто-то другой..."
    new ""

    # game/core/03variables.rpy:402
    old "Вот что значит не везёт. Я долго копил на красивое короткое платье для Алисы и даже купил его, но меня опередил Эрик... И что самое обидное, он купил точно такое же, но подарил его первым. Теперь у меня есть бесполезное платье..."
    new ""

    # game/core/03variables.rpy:402
    old "Вот что значит не везёт. Я долго копил на красивое короткое платье для Алисы, но меня опередил Эрик... Не удивительно. У него же куча денег. Он может себе позволить такие подарки... Кажется, теперь Алиса к нему относится гораздо лучше..."
    new ""

    # game/core/03variables.rpy:402
    old "Да, я сделал это! Мне удалось не только накопить на платье, но и подарить его до того, как нечто подобное сделал Эрик. А он собирался. С его то деньгами это не сложно... Теперь Алиса ко мне относится намного лучше. Ещё бы! Теперь она может ходить по ночным клубам..."
    new ""

    # game/core/03variables.rpy:402
    old "Лиза рассказала мне по секрету кое-что интересное. Оказывается, Алиса не умеет пить. А точнее, капля алкоголя её меняет!"
    new ""

    # game/core/03variables.rpy:402
    old "Именно поэтому она и не соглашается ни на какие алкогольные напитки. Но, может быть, можно придумать что-то другое?"
    new ""

    # game/core/03variables.rpy:402
    old "Итак, у меня есть коробка конфет с ликёром. Судя по надписи на коробке, аромат утончённый. Это значит, есть шанс, что Алиса не заметит алкоголь. Интересно, этого хватит, чтобы её как-то подтолкнуть к этим... безбашенным поступкам?"
    new ""

    # game/core/03variables.rpy:402
    old "Всё получилось. И прошло как-то... слишком неожиданно. О таком даже не принято никому рассказывать. Видимо, лишняя капля алкоголя сорвала Алисе крышу и она напилась в ночном клубе. Ну что же, будем надеяться, что она сама ничего не помнит об этом, а иначе мне не жить..."
    new ""

    # game/core/03variables.rpy:413
    old "Дым сигарет"
    new ""

    # game/core/03variables.rpy:413
    old "Оказалось, что Алиса курит. Причём, она старается это делать, когда дома никого нет. Это можно использовать... Рассказать маме самому или подставить Алису, чтобы мама сама догадалась... А может быть, всё это позволит наладить с Алисой отношения? Столько вариантов. Какой же выбрать?"
    new ""

    # game/core/03variables.rpy:413
    old "Мама всё узнала про сигареты и Алиса была наказана. Причём, серьёзно так, у всех на глазах, да по голой заднице. Что самое печальное - Алиса знает, что это я её сдал. Так что, она меня теперь ненавидит, наверное... Неизвестно, получится ли теперь завоевать её доверие..."
    new ""

    # game/core/03variables.rpy:413
    old "Мама почувствовала сигаретный дым, но я не сдал Алису. Кажется, сестрёнка это оценила. Вот только что мешает её подставить, чтобы мама узнала об этом не от меня, а как бы сама что-то нашла? И я не при делах!\n\nА может быть, эта вредная привычка Алисы поможет мне улучшить с ней отношения?"
    new ""

    # game/core/03variables.rpy:420
    old "Школьница"
    new ""

    # game/core/03variables.rpy:420
    old "Итак, в новой школе Лиза оказалась не такой отличницей, как раньше. Видимо, в новой школе уровень знаний требуется намного более высокий. Ну что же, это хорошая возможность проявить свои школьные знания и помочь младшей сестрёнке разобраться в материале... Или же наоборот, помешать получить хорошую оценку и понаблюдать, как мама её накажет? А может быть, попросить у неё что-то за помощь? Но сначала надо поговорить с Лизой и спросить, что она обо всём этом думает?"
    new ""

    # game/core/03variables.rpy:420
    old "Я поговорил с Лизой насчёт уроков и намекнул, что моя помощь будет стоить... некоторых услуг. Конечно, она отказалась. Но это пока. До первого наказания. Как только её отшлёпают у меня на глазах, всё изменится! Но для этого надо сделать так, чтобы она снова получила двойку..."
    new ""

    # game/core/03variables.rpy:420
    old "Я поговорил с Лизой и пообещал ей, что помогу с уроками. Причём, абсолютно безвозмездно. То есть - даром. Конечно, это не очень свойственно для меня, но зато есть все шансы наладить отношения с сестрёнкой и завоевать её доверие..."
    new ""

    # game/core/03variables.rpy:420
    old "Кажется, я убедил Лизу меня слушаться под страхом наказания. Теперь она будет спать только в футболке и трусах. Ну ничего, я только начал.\n\nТеперь я могу под видом помощи с уроками, подправлять вычисления так, чтобы ей поставили двойку и можно было бы снова наблюдать за её наказанием... Кто знает, может быть, удастся развести её на нечто большее?"
    new ""

    # game/core/03variables.rpy:420
    old "Хоть я и пообещал помогать Лизе с уроками, но делать этого я не стал. И без того было много дел. После очередной двойки и наказания от мамы, она подошла ко мне и упрашивала о помощи. Я согласился, но с условием, что она будет спать только в футболке и трусиках. И думаю, что мне удастся её ещё на что-нибудь раскрутить..."
    new ""

    # game/core/03variables.rpy:420
    old "Правда, Лиза слегка на меня обиделась, но это я переживу. Подарю ей что-нибудь вкусненькое и она оттает... \n\n{i}{b}Внимание:{/b} Пока это всё, что можно сделать для данной \"возможности\" в текущей версии игры.{/i}"
    new ""

    # game/core/03variables.rpy:420
    old "Я помогал Лизе с уроками какое-то время, причём безвозмездно, но это стало довольно скучным делом и я перестал уделять ей внимание с этим. И вот, после очередной двойки и наказания от мамы, она обратилась ко мне за помощью. Я согласился, но с условием, что она будет спать только в футболке и трусиках. И думаю, что мне удастся её ещё на что-нибудь раскрутить..."
    new ""

    # game/core/03variables.rpy:420
    old "Пообещав помогать Лизе с уроками по принципу \"ты мне - я тебе\", я через некоторое время совсем про неё забыл. И вот, после очередной двойки и наказания от мамы, Лиза напомнила о том, что я ей обещал. Пожалуй, мне стоит уделять её урокам больше внимания..."
    new ""

    # game/core/03variables.rpy:420
    old "Под видом помощи с уроками Лизы, я намеренно делал ошибки так, чтобы ей ставили двойки и наказывали... В чём теперь она меня и подозревает. Не удивительно, что Лиза сильно обиделась на меня, но вместе с тем, от моей помощи не отказалась..."
    new ""

    # game/core/03variables.rpy:420
    old "Сомневаюсь, что теперь получится её подставить, уж слишком большое недоверие она ко мне испытывает. \n\n{i}{b}Внимание:{/b} Пока это всё, что можно сделать для данной \"возможности\" в текущей версии игры.{/i}"
    new ""

    # game/core/03variables.rpy:420
    old "Я помогал Лизе с уроками какое-то время, причём безвозмездно, но это стало довольно скучным делом и я намеренно стал делать ошибки так, чтобы ей ставили двойки и наказывали... И вот, после очередной двойки и наказания от мамы, она обратилась ко мне за помощью. Я согласился, но с условием, что она будет спать только в футболке и трусиках. И думаю, что мне удастся её ещё на что-нибудь раскрутить..."
    new ""

    # game/core/03variables.rpy:436
    old "Арахнофобия"
    new ""

    # game/core/03variables.rpy:436
    old "Любопытно. Похоже, Алиса до смерти боится пауков. А надо заметить, что климат тут очень подходит для такого рода насекомых... Нужно будет поймать одного и подкинуть Алисе, вот забавно будет! Вот только как и где их искать?"
    new ""

    # game/core/03variables.rpy:436
    old "Я порылся в интернете и выяснил, что в нашей местности очень легко встретить один вид пауков. К счастью, он совершенно безвредный, но размеры бывают весьма солидные. Ночью их не найти, а вот когда солнце только начинает прогревать землю, они выползают на свет и проверяют свою добычу."
    new ""

    # game/core/03variables.rpy:436
    old "Итак, я поймал огромного паука. Это не так сложно, если знать в какое время и где их ловить. Теперь нужно испытать этого монстра на сестрёнке. Вот только бы выбрать подходящий момент..."
    new ""

    # game/core/03variables.rpy:436
    old "Алиса определённо боится пауков! Визг слышали все соседи со всей округи, это точно! Вот только если Алиса узнает, что я это всё специально подстроил, меня ждёт смерть. Надеюсь, быстрая..."
    new ""

    # game/core/03variables.rpy:436
    old "Алиса так боится пауков, что согласилась раздеться ради того, чтобы я убил одного, который залез в её постель. Ага, сам он залез, как же... Тем не менее, этой её фобией можно пользоваться в своих интересах. Посмотрим, к чему это всё приведёт..."
    new ""

    # game/core/03variables.rpy:436
    old "После очередного избавления от паука я намекнул Алисе, что было бы не плохо, если бы я спал рядом и охранял её. Она отказалась. Видимо, слишком мало пауков попадает к ней в постель..."
    new ""

    # game/core/03variables.rpy:436
    old "Похоже, я способствую развитию арахнофобии у Алисы. Во всяком случае, прогресс очевиден. Теперь Алиса задумывается о том, что было бы неплохо иногда впускать меня в постель для защиты от пауков. Но пока только задумывается... Значит, стоит продолжать..."
    new ""

    # game/core/03variables.rpy:436
    old "Да! Алиса разрешила мне спать рядом. Конечно, потребовалось столько паучьих жертв, но оно того стоило! Первый шаг сделан, разрешение получено, а дальше уже всё пойдёт как по маслу!"
    new ""

    # game/core/03variables.rpy:436
    old "Наши забавы с Алисой в постели, как и ожидалось, дошли до самого интересного... Да она сама на меня прыгает! Слава паукам!"
    new ""

    # game/core/03variables.rpy:448
    old "Альфа"
    new ""

    # game/core/03variables.rpy:448
    old "Итак, я познакомился с этим самым Эриком, бойфрендом мамы. Не могу сказать о нём ничего хорошего или плохого, но он мне не очень понравился. Практически сразу он предложил мне выбрать дружить с ним или воевать. Вот только зачем мне с ним дружить? Что это даст? Да и воевать... Что он может мне сделать? Так или иначе, но он дал на размышления одну неделю. Ну, подумаю как следует и решу что попало..."
    new ""

    # game/core/03variables.rpy:448
    old "С появлением Эрика мои дела стали неожиданно плохи... Во-первых, он предложил отправить меня в какой-то военный лагерь. Вроде бы для того, чтобы сделать из меня мужика... Да я уже Мужик! Сдались мне эти лагеря...\n\nВо-вторых, он убедил маму, что наказывать нас надо как-то иначе. Нет бы что хорошее подсказал, но это... В общем, со следующей недели нас будут наказывать на глазах друг у друга... голыми! Это такой позор! Это же каким надо быть извращенцем, чтобы такое выдумать.\n\nПонятно, что будет прикольно лишний раз увидеть сиськи сестёр, но и меня могут выпороть на глазах у всех. Это же как подорвёт авторитет!\n\nСначала эта дурацкая идея с военным лагерем, теперь ещё и это... Нужно что-то срочно делать!"
    new ""

    # game/core/03variables.rpy:448
    old "Ну что же, у меня такое чувство, что я заключил сделку с дьяволом. Эрик пообещал мне платить какие-то деньги и разрешил подглядывать за ними с мамой. В свою очередь, я не должен мешать ему совращаться свою семью... Кто знает, может быть это позволит и мне поучаствовать в чём-то таком... Если он разрешит..."
    new ""

    # game/core/03variables.rpy:448
    old "Да пошёл он, этот Эрик! Я отказался от его сомнительного предложения и не собираюсь иметь с ним ничего общего. Пусть попробует только полезть, я ему покажу! Глаза мои его бы не видели... Конечно, я отказался от всего что он там мог предложить, но зато моя совесть чиста и моя семья в моих руках!"
    new ""

    # game/core/03variables.rpy:454
    old "Кнут или пряник?"
    new ""

    # game/core/03variables.rpy:454
    old "Лиза заметила, что я подглядывал, как она принимает душ. Я попробовал извиниться и пообещал купить ей какую-нибудь сладость. В обмен на это Лиза не станет рассказывать обо всём маме, но времени у меня немного..."
    new ""

    # game/core/03variables.rpy:454
    old "К сожалению, я не успел подарить Лизе сладость в срок и поэтому она рассказала маме, как я за ней подглядывал. Возможно, в следующий раз, если Лиза меня заметит, я успею..."
    new ""

    # game/core/03variables.rpy:454
    old "Я купил для Лизы шоколад \"Ritter Sport\" и она была очень довольна! Ещё бы, ведь оказалось, что это её любимая сладость! Может быть, в следующий раз, стоит подарить ей большые шоколадки?"
    new ""

    # game/core/03variables.rpy:454
    old "Я купил для Лизы конфеты \"Raffaello\" и она приняла их, но без особого восторга! Возможно, в следующий раз, следует подарить ей что-то другое?"
    new ""

    # game/core/03variables.rpy:454
    old "Я купил для Лизы конфеты \"Ferrero Rocher\" и как оказалось, они ей не нравятся! В следующий раз, лучше подарить что-то другое..."
    new ""

    # game/core/03variables.rpy:454
    old "Как оказалось, за нравящиеся Лизе сладости можно получить крепкие объятия! И это не смотря на то, что я за ней подглядывал. Посмотрим, что ещё мне удастся получить от сестрёнки..."
    new ""

    # game/core/03variables.rpy:454
    old "Обнимашки - не единственное, что я получил от Лизы за сладости. Она была в таком восторге, что даже чмокнула меня в щёку! Вот уж не думал, что подглядывания за сестрёнкой могут обернуться такими приятными неожиданностями! Интересно, что будет дальше..."
    new ""

    # game/core/03variables.rpy:454
    old "Похоже, сладостей Лизе уже мало и она хочет халатик, как у Алисы. Это уже серьёзная покупка! На этот раз времени у меня больше, но всё равно лучше поторопиться с подарком. Интересно, что меня будет за это ждать..."
    new ""

    # game/core/03variables.rpy:454
    old "От моих подарков Лиза уже не просто целует меня в щёку, а запрыгивает на меня с крепкими объятиями! Может быть и мне уже пора в такие моменты проявлять какую-то активность? Так что подглядывать полезно, если правильно извиниться."
    new ""

    # game/core/03variables.rpy:466
    old "Кто не рискует..."
    new ""

    # game/core/03variables.rpy:466
    old "Я подглядывал, как Алиса принимает душ и она меня заметила. Пытаясь извиниться я пообещал купить ей какую-нибудь сладость, в обмен на то, чтобы она не рассказывала обо всём маме. На удивление, я ещё жив, но времени у меня немного..."
    new ""

    # game/core/03variables.rpy:466
    old "Увы, я не успел подарить Алисе сладость в срок и поэтому она рассказала маме, как я за ней подглядывал. Возможно, в следующий раз, если Алиса меня заметит, я успею..."
    new ""

    # game/core/03variables.rpy:466
    old "Я купил для Алисы конфеты \"Ferrero Rocher\" и она была очень довольна! Ещё бы, ведь оказалось, что это её любимая сладость! Может быть, в следующий раз, стоит подарить ей большую коробку с этими конфетами?"
    new ""

    # game/core/03variables.rpy:466
    old "Я купил для Алисы шоколад \"Ritter Sport\" и она приняла его, но без особого восторга! Возможно, в следующий раз, следует подарить ей что-то другое?"
    new ""

    # game/core/03variables.rpy:466
    old "Я купил для Алисы конфеты \"Raffaello\" и как оказалось, они ей не нравятся! В следующий раз, лучше подарить что-то другое..."
    new ""

    # game/core/03variables.rpy:466
    old "Эх... Если бы я знал, что Алиса станет выкручивать мне уши, то подумал бы, стоит ли ей дарить сладости! Хотя, тогда я рискую быть наказанным при всех, а это хуже... Так что лучше и в следующий раз рискнуть, вдруг повезёт и Алиса ничего мне не сделает."
    new ""

    # game/core/03variables.rpy:466
    old "Как оказалось, за нравящиеся Алисе сладости можно не только сохранить уши в целости, но и ощутить её скромные объятия! И это не смотря на то, что я за ней подглядывал. Посмотрим, что ещё мне удастся получить от сестрёнки..."
    new ""

    # game/core/03variables.rpy:466
    old "Похоже, сладостей Алисе уже мало и теперь ОНА будет ставить условия! Она хочет, чтобы я купил ей пижаму и это уже покупка посерьёзнее! На этот раз времени у меня больше, но всё равно лучше поторопиться с подарком. Интересно, что меня будет за это ждать..."
    new ""

    # game/core/03variables.rpy:466
    old "Алиса согласилась пустить меня к себе в комнату, пока примеряла пижаму! Конечно, она просила, чтобы я не подглядывал, хотя прекрасно знала, что я буду... И угрозы её стали какими-то шуточными. Интересно, к чему это приведёт? Так что подглядывать полезно, если правильно извиниться."
    new ""

    # game/core/03variables.rpy:478
    old "Кристина"
    new ""

    # game/core/03variables.rpy:478
    old "Моими подозрительными заказами всякой женской одежды заинтересовалась девчонка из доставки. Как выяснилось, её зовут Кристина. \nЯ не решился подкатить к ней... Она бы меня наверняка отшила. Хотя, попробовать всё равно можно было..."
    new ""

    # game/core/03variables.rpy:478
    old "Моими подозрительными заказами всякой женской одежды заинтересовалась девчонка из доставки. Как выяснилось, её зовут Кристина. \nНе самым умным решением было к ней сразу же подкатывать, но что сделано, то сделано. Понятно, что она бы в любом случае меня отшила, но попробовать стоило..."
    new ""

    # game/core/03variables.rpy:484
    old "Контроль"
    new ""

    # game/core/03variables.rpy:484
    old "Что это было? Мама поймала меня на подглядывании за ними, пока они трахались, собиралась наказать, но Эрик сказал нет и мама согласилась?! Моя мама, которая запрещала мне смотреть даже эротику, согласилась, чтобы я присутствовал при таком? Это невероятно. Либо Эрик какой-то колдун, либо дело в другом и нужно в этом разобраться, как следует."
    new ""

    # game/core/03variables.rpy:488
    old "Компромат на Эрика"
    new ""

    # game/core/03variables.rpy:488
    old "Мне случайно удалось заметить, как Эрик посреди ночи стоит около окна в комнату Алисы и дрочит на неё! Не ожидал я такое увидеть... Мне казалось, что Эрик из тех, кто скорее проститутку снимет, чем будет просто дрочить, но как оказалось... я ошибался.\n\nНаверняка он делает это уже не первый раз! Надо понаблюдать за ним по ночам, чтобы заполучить снимок с его грязными делишками... Лучше иметь против него козырь, на случай чего..."
    new ""

    # game/core/03variables.rpy:488
    old "Получилось! Я сфотографировал, как Эрик дрочит на Алису! Конечно, на самом деле на снимке не понятно, на кого или на что он дрочит, так что не слишком-то эта фотография мне поможет в случае какой-нибудь заварушки с Эриком.\n\nБыло бы хорошо, если бы Эрик обнаглел настолько, что стал дрочить на Алису прямо посреди её комнаты... Вот это уже бы тянуло на компромат! В кадр правда попадёт Алиса, но основное внимание на такой фотографии будет приковано к Эрику. Дело за малым - придумать, как заманить его в комнату Алисы..."
    new ""

    # game/core/03variables.rpy:488
    old "Я так и знал, что Эрик не устоит перед голой и спящей Алисой! Правда, можно ли его за это винить? Я бы на его месте тоже не устоял... Теперь, остаётся лишь успеть сделать снимок, пока он в её комнате..."
    new ""

    # game/core/03variables.rpy:488
    old "Вот всё и получилось! У меня есть два снимка, на которых Эрик, как грязный извращенец, дрочит пока все спокойно спят... А на одном из снимков даже видно на кого он дрочит...\n\nМне стоит быть осторожнее с этими снимками, Эрик столько всего делает для моих сестёр, что они запросто могут рассказать о том, что у меня есть. А так же хорошенько подумать над тем, как я буду использовать эти снимки.\n\nЯ могу придержать этот компромат, пойти с ним к Эрику в ближайшее время или же вовсе как-то подставить его..."
    new ""

    # game/core/03variables.rpy:620
    old "Общение"
    new ""

    # game/core/03variables.rpy:620
    old "Навыки общения: Чувства человека"
    new ""

    # game/core/03variables.rpy:620
    old "Это базовый курс обучения навыкам общения и содержит в себе основную информацию об органах чувств, о реакции человека на ваши слова, а также основы языка тела."
    new ""

    # game/core/03variables.rpy:620
    old "Навыки общения: Основы коммуникации"
    new ""

    # game/core/03variables.rpy:620
    old "Это второй курс обучения навыкам общения. Из него вы узнаете как повлиять на решение человека без слов, как подобрать правильный слова в нужной ситуации для достижения своей цели."
    new ""

    # game/core/03variables.rpy:620
    old "Навыки общения: Без границ"
    new ""

    # game/core/03variables.rpy:620
    old "Это продвинутый длительный курс, предназначенный для тех, кто хочет постоянно обучаться и совершенствоваться. На данный момент это последний доступный курс."
    new ""

    # game/core/03variables.rpy:736
    old "Эрик"
    new ""

    # game/core/03variables.rpy:736
    old "Эрика"
    new ""

    # game/core/03variables.rpy:736
    old "Эрику"
    new ""

    # game/core/03variables.rpy:736
    old "Эриком"
    new ""

    # game/core/03variables.rpy:736
    old "Эрике"
    new ""

    # game/core/03variables.rpy:736
    old "Ещё до того, как мама познакомила меня со своим внезапным ухажёром Эриком, я начал чувствовать, что ничего хорошего он в мою жизнь не принесёт. Слишком уж он подозрительный..."
    new ""

    # game/core/03variables.rpy:777
    old "Кира"
    new ""

    # game/core/03variables.rpy:777
    old "Киры"
    new ""

    # game/core/03variables.rpy:777
    old "Кире"
    new ""

    # game/core/03variables.rpy:777
    old "Киру"
    new ""

    # game/core/03variables.rpy:777
    old "Кирой"
    new ""

    # game/core/03variables.rpy:777
    old "Тётя Кира, мамина младшая сестра. Конечно, у неё и раньше не были замечены какие-либо комплексы, но сейчас она стала такой... такой..."
    new ""

    # game/core/03variables.rpy:888
    old "Любимая тётя"
    new ""

    # game/core/03variables.rpy:888
    old "Итак, к нам приехала тётя Кира, мамина младшая сестра. Конечно, и раньше не были замечены у неё какие-либо комплексы, но сейчас она стала такой... такой... А ещё она увидела мой член, в первый же день! Так неловко. Но и себя тётя Кира показала во всей красе, в таком купальнике, если его можно назвать купальником... Да ещё такие намёки на моего папу. Неужели, они были настолько... знакомы? Нужно выпытать у неё всё, что только возможно."
    new ""

    # game/core/03variables.rpy:888
    old "Я рассказал тёте Кире всё про Эрика, вот как есть, так и сказал. Кажется, она сомневается в моих словах, но пообещала аккуратно всё выяснить и разузнать. Может быть, даже с самим Эриком пообщается..."
    new ""

    # game/core/03variables.rpy:888
    old "Вот это да! Моя тётя снимается в порно! Неужели, я живу рядом с порнозвездой? Теперь понятно, почему меня к ней так и тянет. Её просто окружает аура секса! Может быть, ещё больше сблизиться с ней будет не так сложно, как я думал..."
    new ""

    # game/core/03variables.rpy:888
    old "Кира предложила мне немного заработать. Нужно лишь её пофотографировать. Вот только для этих целей нужен фотоаппарат. Конечно, вряд-ли она заплатит мне столько, сколько стоит фотоаппарат, зато есть шанс, что мне что-нибудь обломится другое за эту фотосессию..."
    new ""

    # game/core/03variables.rpy:888
    old "Фотосессия вышла классная, хоть ничего нового я для себя и не открыл. Ну почти, были интересные моменты, а это намного лучше, чем вообще ничего! Теперь нужно немного подождать, чтобы стало понятно, насколько удачными получились снимки. Может я даже что-то и получу за эту фотосессию..."
    new ""

    # game/core/03variables.rpy:888
    old "Итак, снимки вышли удачными и мы с Кирой договорились на новую фотосессию, пока никого не будет дома. Но ещё не ясно, когда мы её проведём... Интересно, что такое Кира хочет достать для съёмок!? Остаётся только ждать..."
    new ""

    # game/core/03variables.rpy:888
    old "Вот и состоялась вторая фотосессия! И она была отпадной! Не только потому что Кира решила пофотографироваться на тему БДСМ, но и потому что у нас был секс... Мой первый, настоящий секс... Теперь я официально больше не девственник! Вернее, неофициально... я ведь трахался с тётей. Надеюсь, не в последний раз! Хотя, с этим Эриком, который во всё лезет, лучше быть очень осторожным..."
    new ""

