# TODO: Translation updated at 2021-03-02 01:41

# game/core/core.rpy:469
translate deutsch AfterWaiting_c2510a45:

    # Max_00 "Я слишком устал. Надо бы вздремнуть..."
    Max_00 ""

# game/core/core.rpy:518
translate deutsch night_of_fun_cae91685:

    # Max_19 "Теперь можно спокойно спать и ничего больше..."
    Max_19 ""

# game/core/core.rpy:547
translate deutsch cam_after_waiting_6058d5d4:

    # Max_09 "Думаю, просматривать сейчас камеры не самая лучшая идея. Не хватало ещё, чтобы Лиза что-то заметила... Может, стоит пойти на веранду? Там сейчас не должно никого быть..." nointeract
    Max_09 "" nointeract

# game/core/core.rpy:555
translate deutsch cam_after_waiting_c283f316:

    # Max_09 "Лиза сейчас в комнате... И на веранде место занято! Лучше не рисковать и подождать с просмотром камер."
    Max_09 ""

# game/core/core.rpy:559
translate deutsch cam_after_waiting_38f46f18:

    # Max_09 "Лучше просматривать камеры в другом месте! Не хватало ещё, чтобы Лиза что-то заметила..." nointeract
    Max_09 "" nointeract

# game/core/core.rpy:571
translate deutsch cam_after_waiting_d4f49617:

    # Max_09 "Пожалуй, не стоит сейчас просматривать камеры. Лиза может проснуться и заметить, что я делаю... Может, стоит пойти на веранду? Там сейчас не должно никого быть..." nointeract
    Max_09 "" nointeract

# game/core/core.rpy:579
translate deutsch cam_after_waiting_c283f316_1:

    # Max_09 "Лиза сейчас в комнате... И на веранде место занято! Лучше не рисковать и подождать с просмотром камер."
    Max_09 ""

# game/core/core.rpy:583
translate deutsch cam_after_waiting_eea92f18:

    # Max_09 "Лучше просматривать камеры в другом месте! Лиза может проснуться и заметить, что я делаю..." nointeract
    Max_09 "" nointeract

# game/core/core.rpy:639
translate deutsch cam_after_waiting_27f05bf1:

    # Max_00 "Сейчас здесь ничего не происходит."
    Max_00 ""

# game/core/core.rpy:675
translate deutsch after_buying_5c93d1fb:

    # Max_01 "{i}( Так, фотокамеру я заказал, осталось дождаться доставки... ){/i}"
    Max_01 ""

# game/core/core.rpy:676
translate deutsch after_buying_7c1c8dcc:

    # Max_07 "{i}( Интересно, а в чём тётя Кира будет фотографироваться из одежды? Ей это нужно для порно-портфолио... Так может мне стоит прикупить что-нибудь сексуальное для неё?! Например, более откровенную ночнушку! Это пойдёт мне только в плюс... ){/i}"
    Max_07 ""

# game/core/core.rpy:694
translate deutsch after_load_6c975de3:

    # "Сохранения версии техно-демо не поддерживаются. Начните новую игру или выберите другое сохранение."
    ""

# game/core/core.rpy:698
translate deutsch after_load_93331e6b:

    # "К сожалению сохранения этой версии не поддерживаются из-за большого количества внутренних изменений. Начните новую игру или выберите другое сохранение."
    ""

# game/core/core.rpy:702
translate deutsch after_load_93331e6b_1:

    # "К сожалению сохранения этой версии не поддерживаются из-за большого количества внутренних изменений. Начните новую игру или выберите другое сохранение."
    ""

translate deutsch strings:

    # game/core/core.rpy:356
    old "В интернет-магазине доступен новый товар."
    new ""

    # game/core/core.rpy:547
    old "{i}идти на веранду{/i}"
    new ""

    # game/core/core.rpy:547
    old "{i}не сейчас{/i}"
    new ""

    # game/core/core.rpy:677
    old "А ещё, будет не лишним, купить для этой фотосессии сексуальную сорочку для моей любимой тёти!"
    new ""

    # game/core/core.rpy:805
    old "{color=#E59400}{i}Алисе понравился массаж!{/i}{/color}\n"
    new ""

    # game/core/core.rpy:1176
    old "Я решил, что и мне самому будет полезно прочитать купленую для Лизы книгу. Вдруг, тем самым, я что-то для себя интересное открою..."
    new ""

    # game/core/core.rpy:1208
    old "Я подарил Алисе симпатичный комплект нижнего белья. Ей очень понравилось. Она даже при мне его примерила! Правда, я почти ничего не увидел, но было волнующе... Что самое любопытное, она намекнула, что можно поискать и что-то более... сексуальное!"
    new ""

    # game/core/core.rpy:1370
    old "А что если я не буду помогать Лизе какое-то время? Или несколько раз сделаю ошибку в её работе?"
    new ""

