# TODO: Translation updated at 2021-05-02 21:51

translate english strings:

    # game/core/09_opportunities.rpy:4
    old "Да, и похоже о своём мальчике Лиза разговаривает только, когда у неё хорошее настроение..."
    new ""

    # game/core/09_opportunities.rpy:4
    old "Правда, Лиза слегка на меня обиделась, но это я переживу. Подарю ей что-нибудь вкусненькое и она оттает..."
    new ""

    # game/core/09_opportunities.rpy:4
    old "Сомневаюсь, что теперь получится её подставить, уж слишком большое недоверие она ко мне испытывает."
    new ""

    # game/core/09_opportunities.rpy:4
    old "На этот раз Лиза не стала просить сладости или одежду... Она решила \"наказать меня\" совместным просмотром фильмов перед сном! Всё бы ничего, да смотреть мы будем романтические фильмы... Остаётся надеяться, что это будет терпимо, потому что глазеть на принимающую душ Лизу я люблю."
    new ""

    # game/core/09_opportunities.rpy:4
    old "Затея Лизы с просмотром романтики оказалась лучше, чем я думал! По крайней мере для меня. Сестрёнка в нижнем белье со мной рядом в одной постели! А на экране ещё и откровенные сцены мелькают, да такие, что у меня встал! Лизу это как-то не обрадовало, но посмотрим, что будет дальше..."
    new ""

    # game/core/09_opportunities.rpy:4
    old "Лизе надоели мои стояки при просмотре романтических фильмов и она решила, что мы будем теперь смотреть то, от чего у меня точно не встанет - ужастики! Ага, ужастики перед сном, в темноте... Отчаянная у меня сестрёнка!"
    new ""

    # game/core/09_opportunities.rpy:4
    old "Ужастики тоже не спасают от стояка... Лиза от страха так крепко прижимается ко мне своим почти голым телом, что сдержаться и не возбудиться очень трудно... Может, хоть раз попытаться устоять и тогда Лиза не сбежит так быстро?"
    new ""

    # game/core/09_opportunities.rpy:4
    old "Лиза хоть и убежала в свою постельку, но мне удалось воспользоваться моментом и поцеловать её на ночь, чтобы ей было не так страшно! Может, со временем ей не захочется уходить от меня или даже больше..."
    new ""

