# TODO: Translation updated at 2021-04-11 22:26

# game/core/oldfix.rpy:6
translate english old_fix_6c975de3:

    # "Сохранения версии техно-демо не поддерживаются. Начните новую игру или выберите другое сохранение."
    ""

# game/core/oldfix.rpy:10
translate english old_fix_93331e6b:

    # "К сожалению сохранения этой версии не поддерживаются из-за большого количества внутренних изменений. Начните новую игру или выберите другое сохранение."
    ""

# game/core/oldfix.rpy:14
translate english old_fix_93331e6b_1:

    # "К сожалению сохранения этой версии не поддерживаются из-за большого количества внутренних изменений. Начните новую игру или выберите другое сохранение."
    ""

